[
  {
    "id": "first-hello",
    "date": "2024-10-20",
    "title": "The Day We Started Speaking",
    "content": "The day our story began. The day I decided to message you on Instagram and just hope for the best. From that first message, I knew there was something special about you.",
    "tags": ["first", "special", "beginning"],
    "private": false
  },
  {
    "id": "first-call",
    "date": "2024-10-28",
    "title": "Our first call",
    "content": "After talking for days on text and messaging, we finally had our first call. It was so sudden and unexpected, when I heard your voice for the first time my heart skipped a beat. I was so nervous - I think this is the most nervous I've ever been with you and I was lost for words. It was such short call but that moment I felt connected to you in a different way. I didn't know what to expect but I noticed you had a slight Sri Lankan accent. After the call you told me you were so nervous too and we laughed about how you had an accent and that no one ever said that about you, everyone said your English sounded so posh.",
    "tags": ["first", "special", "milestone"],
    "private": false
  },
  {
    "id": "first-met",
    "date": "2024-11-20",
    "title": "We First Met",
    "content": "After a month of talking, we finally met in person. I was begging to see you even just for 5-10 minutes as I was so curious to put a face to the voice I had been talking to over the phone. I remember driving down to you from my house in Hemel Hempstead to see you whilst you were staying over at your uncle's house in Hounslow. I came in my silver Golf near the address you gave me, and I was a little nervous but excited to see you. I was driving down your road looking for you and messaging you to check where you were. I noticed a woman wearing black and I had a feeling that might be you, and cool, calm and collected opened my window and asked is that Thuvaraha. You were like yeah, so I parked up next to the kerb and opened the door from the inside and said jump in. The first time meeting you, I wanted to make this a special one so I got you white flowers to keep as a memory of us. The way we spoke everything felt so natural and easy. We were touching each others hands and i was caressing your knee, I never thought it would pan out this way. I even kissed you on the dorsum of you hand and your cheek even though I had embarrasingly asked you first. I didn't want to make you uncomfortable so I thought it would be courteous to ask first. We even took our first few photos of each other. Till this day from the moment I laid my eyes on you, I felt so at peace. I knew I had to make you mine.",
    "tags": ["first", "special", "milestone"],
    "private": false
  },
  {
    "id": "first-date-bowling",
    "date": "2024-12-01",
    "title": "First Date - Bowling & Our First Kiss",
    "content": "Our very first official long awaited date! I could finally take you somewhere to spend quality time and do an activity. I took you to Airport Bowling in Hounslow. I told you I was alright and not great at bowling, but by the end you felt like I cheated you and downplayed my skills. I was lowkey gassed how I did and it was so much fun. This was also the first time you drank alcohol. I decided to get a vodka and lemonade to loosen up a bit and you took a sip from my cup. We went to arcade after and played a bunch of random games, I loved seeing you play. I was beating you at every game but I think you eventually beat me at something... Basketball. I really need to work on that. After everything, we got in the car and were just chilling and talking together. The conversation was flowing so naturally, and I felt so comfortable with you. I kept looking at you, I couldn't take my eyes off you. We shared our ever first kiss that day. Everything around us faded away, and in that moment, it was just us. Time stood still... it was perfect. I will never forget that day.",
    "tags": ["first", "fun", "date", "romantic", "special"],
    "private": false
  },
  {
    "id": "second-date-croydon",
    "date": "2024-12-06",
    "title": "Second Date in Croydon",
    "content": "Our second date taking you to Croydon for you to spend time with your friends at the Airbnb. I remember we were sitting in the back seat and I showed you videos of my brother's wedding and reception. That moment felt beautiful and I was so happy I turned my head to kiss you and we couldn't stop kising after that. Once it was getting pretty late, I didn't want to let you go. We got out of the car and hugged each other so tight. I spent the whole journey home thinking about us and how much I was falling for you.",
    "tags": ["date", "fun", "romantic"],
    "private": false
  },
  {
    "id": "24hr-challenge",
    "date": "2024-12-11",
    "title": "24 Hours Challenge",
    "content": "The 24-hour silence challenge you wanted to try. I was struggling so much with the urge to message you, but I didn't want to be the first to break. You expected me to cave, and so many thoughts were running through my head about whether I should just text you. Thankfully, I was working at Abbey's that day and it got super busy, plus I downloaded Whiteout Survival (yes, that game that's caused us so many petty arguments and laughs since then hehe). I even slept early to stop overthinking. When the challenge finally ended, I was so happy to hear from you again. It was worth it, but never again!",
    "tags": ["funny", "challenge", "sweet"],
    "private": false
  },
  {
    "id": "i-said-i-love-you",
    "date": "2024-12-20",
    "title": "I Said I Love You",
    "content": "The day I finally told you I love you. We were both in the back seat of my VW Golf, just chilling together. I had brought my laptop from work since it was my work from home day. In the days leading up to this, we had been getting closer and closer, getting to know each other on a deeper level, and it felt like everything was falling into place. Sitting there with you, it finally felt like the right time. It wasn't a grand gesture or a dramatic moment - just us together in the simplest of settings. The world around us faded away, and I looked at you and said those three words that had been building up inside me: \"I love you.\" It was a surreal moment, but I couldn't keep it in anymore. I knew way before how much you meant to me and how I felt about you. You mean everything to me, and I needed you to know.",
    "tags": ["milestone", "romantic", "special"],
    "private": false
  },
  {
    "id": "she-said-i-love-you",
    "date": "2024-12-27",
    "title": "She Said I Love You",
    "content": "The day you said those three magical words  to me. We were in the same setting as when I first told you - in the back seat of my VW Golf, just us together. I honestly never expected to hear it back so soon. I thought I'd be waiting weeks, months even, wondering if you felt the same way. But there you were, looking at me with those beautiful eyes, and you said \"I love you.\" My heart exploded with happiness in that moment. I couldn't believe what I was hearing. All the thinking, all the waiting, it melted away instantly. Hearing you say 'I love you' was the best gift I could ever receive from you in that moment. It made everything real. You loved me back, and nothing else in the world mattered.",
    "tags": ["milestone", "romantic", "special"],
    "private": false
  },
  {
    "id": "honeymoon-restaurant",
    "date": "2024-12-30",
    "title": "First Restaurant Date - Honeymoon",
    "content": "Our first proper restaurant date at Honeymoon. You came up with the idea to go to a restaurant together. I was so excited to go out and have a proper food date with you. The food was amazing, and the atmosphere was really nice. I was scared that someone I know might see us. there was nothing more beautiful than being across the table from you seeing your beautiful smile and eyes.",
    "tags": ["date", "romantic", "food"],
    "private": false
  },
  {
    "id": "intimate-moment",
    "date": "2025-01-04",
    "title": "Our Most Intimate Moment",
    "content": "January 4th, 2025. The day we became intimate and became one. A moment of pure bliss, love, trust, and connection. We booked a hotel together to spend the night together. It brought us ever closer and shared an experience that will always be special. This memory is just for us.",
    "tags": ["intimate", "special", "private"],
    "private": true,
    "password": "forever"
  },
  {
    "id": "valentine-ask",
    "date": "2025-02-02",
    "title": "Be My Valentine",
    "content": "The day I asked you to be my Valentine. I wanted to make it special, so I made you a handmade origami heart and wrote you a card asking you to be mine. I also got you beautiful flowers to show you how much you mean to me. When I gave it all to you, seeing your face light up made my heart skip a beat. And of course, you said yes! I couldn't wait to spend our first Valentine's Day together, making it a memory we'd cherish forever.",
    "tags": ["romantic", "valentine", "sweet"],
    "private": false
  },
  {
    "id": "valentines-day-2025",
    "date": "2025-02-14",
    "title": "Our First Valentine's Day Together",
    "content": "The 14th of February, Valentine's Day, was one of the most memorable days of my life. I wanted to show you how much love and care I have for you. I planned out a whole day for us to spend together. I booked a beautiful accommodation so we could have our own space - it had a separate bedroom, lounge area with a kitchen and shower. I brought you to the place with my hire car as I had crashed my VW Golf but wanted to surprise you, so I didn't tell you where we were going. The moment you stepped into the room, there were rose petals scattered across the floor for you to walk the path into the living room to a heart shape with ILU written in rose petals. There was also a bouquet of roses and a gift bag with presents I chose for you. I will always remember that moment of surprise and happiness on your face. We spent the day in each other's company. We even cooked one of your favorite desserts - crêpe. I knew you liked to have it with crushed Oreos and Nutella chocolate, so I made sure to have that ready beforehand. I paid attention to every little thing you loved, like your favorite pizza toppings, although we didn't end up making it. We left the place wanting to spend more time together. I didn't want to let you go. Your joy is my joy. Seeing you smile is everything to me. This was just our first Valentine's Day, but with each year it will be a reminder of how deeply I love you.",
    "tags": ["romantic", "valentine", "special", "milestone"],
    "private": false
  },
  {
    "id": "pf-changs",
    "date": "2025-03-23",
    "title": "First Central Motive - PF Chang's",
    "content": "Our first central London restaurant date together! PF Chang's for dinner, the food was  amazing we tried dynamite shrimps which was so full of flavour and you were so excited to try it with me. You wanted me to try anything I wanted and you were being so loving and caring. What I loved even more was the first sitting opposite me. You looked abosolutely stunning, from the hair, to the dress, to your beautiful eyes it was perfect. I felt so lucky and happy to be with you. We had a great time and I can't wait to go on more dates like thiswith you.",
    "tags": ["date", "food"],
    "private": false
  },
  {
    "id": "girlfriend-proposal",
    "date": "2025-04-20",
    "title": "I Asked You to Be My Girlfriend",
    "content": "Six months after we first spoke. I thought about this for a long time and it felt like the right time for us to make it official. A lot of planning went into this day. I wanted to make this moment special for you, something you would remember forever. I scattered red rose petals across the floor creating a path for you to walk. I decorated the room with red foil balloons on the wall with the words 'WILL YOU BE MY GF?' and filled the room with red balloons on the top and scattered on the floor to create a romantic atmosphere.  But the part I'm most proud of is (and I didn't know I could even be this createive) was the heart-shaped Ferrero Rocher bouquet I handmade from scratch. I made everything by hand, the heart-shaped card that sat at the top, the wooden sticks to prop it up, stuck each chocolate on with hot glue gun arranging them in the shape of a heart, and wrapped it with beautiful black and gold wrapper finished with red ribbon. I wanted to make itperfect for you. I also made a big card that said '6 Months of Love' filled with pictures of us together. Each one was like a mini card, you open it up and it shares some of my favourite memories in the six months we had been together. I got you presents too, gifts wrapped in red satin ribbons with bows and wrapped in nice black wrapping paper and I placed on the bed alongside everything else. The room had this so beautiful and romantic from the balloons, the rose petals, the chocolates, the presents, everything came together perfectly as I had envisioned. When I finally asked you to be my girlfriend, and you said yes, it was the happiest 'yes' of my life. You're officially mine, and I'm yours... forever...",
    "tags": ["milestone", "special", "romantic", "official"],
    "private": false
  },
  {
    "id": "greenwood-friends",
    "date": "2025-05-25",
    "title": "First Time With My Friends - Greenwood",
    "content": "The first time you met and hung out with my friends at Greenwood. I first introduced you to Saru and you guys got along well and were speaking to each other like you knew each other. You were nervous at first but when as you spoke you shone with confidence. Finally when my friends all came you fit in perfectly. Watching you get along and laugh with my friends made me fall for you even more. It was so nice to hear from people after the event how nice they thought you were and even got a few compliments on how beautiful you were. That day you looked absolutely stunning as you always do.",
    "tags": ["friends", "milestone", "fun"],
    "private": false
  },
  {
    "id": "my-birthday-2025",
    "date": "2025-09-01",
    "title": "My Birthday - Three Day Celebration",
    "content": "My first birthday with you. You planned an amazing three-day trip just for me, filled with activities I love. I picked you up from Hemel Hempstead station, then we headed to the Leonardo Hotel in London. The interior was absolutely beautiful and stunning. I was waiting for a few hours while you set up the surprise, but it was so worth the wait. You kept coming to check up on me and that was really sweet. We got food together and chilled and spoke whilst we waited for the clock to hit midnight. When it was finally ready, you took me to the room and I finally saw what you had ready for me, I was blown away. You had decorated the room with black and silver metallic balloons and foil balloons spelling 'HAPPY BIRTHDAY' on the headboard with LED string lights. You arranged dark rose petals in a heart shape on the bed with LED tea lights, and elegant black gift boxes with custom ribbons, and the number 27 big balloons. I was so ecstatic and over the moon. For my presents, you got me clothes for my trip to Malaysia on the 3rd and a professional grade trimmer. Something I will cherish for the rest of my life - the first birthday you did for me. Over the three days, you carefully planned activities that I would love and you took me to F1 Arcade, Electric Shuffle, The Cube. On my birthday you took me to the Shard at Hutong restaurant, an expensive luxury restaurant. I couldn't believe you, you lied to me pretending we're going some place else but I was so shocked and felt so happy and grateful you went out of your way to plan this. We both got dressed nicely for the occasion and took stunning photos of each other. You put so much time and effort making it special. Saying goodbye to you was the hardest part as I was going to take the flight to Malaysia the next day. I wish I could take you with me.",
    "tags": ["birthday", "special", "romantic", "milestone"],
    "private": false
  },
  {
    "id": "jupiter-drive",
    "date": "2025-09-10",
    "title": "First Time at Jupiter Drive",
    "content": "The first time you came to my house at Jupiter Drive. I came back from Malaysia early and it was just me and you. We spent so much quality time together and honestly it was the best just being in your presence, getting a glimpse of what life would look like living with you. We cooked together, did some household chores, watched movies and series, had plenty of intimate moments. It was so romantic and peaceful. Waking up next to you was a dream I couldn't stop cuddling you, making breakfast together, doing everyday things side by side with you it felt like wa dream. We had loads of deep meaningful conversations, laughed together, and just enjoyed each other's company in the most natural way. It was a taste of our future together and I loved every single moment.",
    "tags": ["special", "intimate", "milestone"],
    "private": false,
    "password": "forever"
  }
]
